tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1765_tdd.h
#define SSP1MSK2                      522
#define MSK2                          523
#define SSP1MSK3                      524
#define MSK3                          525
#define SSP1MSK4                      526
#define MSK4                          527
#define SSP1MSK5                      528
#define MSK5                          529
#define SSP1MSK6                      530
#define MSK6                          531
#define SSP1MSK7                      532
#define MSK7                          533
#define SSP1STAT                      534
#define BF                            535
#define UA                            536
#define R_nW                          537
#define S                             538
#define P                             539
#define D_nA                          540
#define CKE                           541
#define SMP                           542
#define SSP1CON1                      543
#define SSPM0                         544
#define SSPM                          545
#define SSPM1                         546
#define SSPM2                         547
#define SSPM3                         548
#define CKP                           549
#define SSPEN                         550
#define SSPOV                         551
#define WCOL                          552
#define SSP1CON2                      553
#define SEN                           554
#define RSEN                          555
#define PEN                           556
#define RCEN                          557
#define ACKEN                         558
#define ACKDT                         559
#define ACKSTAT                       560
#define GCEN                          561
#define SSP1CON3                      562
#define DHEN                          563
#define AHEN                          564
#define SBCDE                         565
#define SDAHT                         566
#define BOEN                          567
#define SCIE                          568
#define PCIE                          569
#define ACKTIM                        570
#define BORCON                        571
#define BORRDY                        572
#define BORFS                         573
#define SBOREN                        574
#define FVRCON                        575
#define ADFVR                         576
#define CDAFVR                        577
#define TSRNG                         578
#define TSEN                          579
#define FVRRDY                        580
#define FVREN                         581
#define ZCD1CON                       582
#define ZCD1INTN                      583
#define ZCD1INTP                      584
#define ZCD1POL                       585
#define ZCD1OUT                       586
#define ZCD1EN                        587
#define ODCONA                        588
#define ODA0                          589
#define ODA1                          590
#define ODA2                          591
#define ODA4                          592
#define ODA5                          593
#define ODCONC                        594
#define ODC0                          595
#define ODC1                          596
#define ODC2                          597
#define ODC3                          598
#define ODC4                          599
#define ODC5                          600
#define CCPR1L                        601
#define RL                            602
#define CCPR1H                        603
#define RH                            604
#define CCP1CON                       605
#define CCP1CON_MODE                  606
#define CCP1CON_MODE0                 607
#define CCP1MODE                      608
#define CCP1MODE0                     609
#define CCP1MODE1                     610
#define CCP1CON_MODE1                 611
#define CCP1MODE2                     612
#define CCP1CON_MODE2                 613
#define CCP1MODE3                     614
#define CCP1CON_MODE3                 615
#define FMT                           616
#define CCP1FMT                       617
#define CCP1CON_OUT                   618
#define CCP1OUT                       619
#define CCP1EN                        620
#define CCP1CON_EN                    621
#define CCP1CAP                       622
#define CCP1CTS0                      623
#define CTS                           624
#define CCP1CTS                       625
#define CTS0                          626
#define CCP1CTS1                      627
#define CTS1                          628
#define CCP1CTS2                      629
#define CTS2                          630
#define CCPTMRS                       631
#define C1TSEL0                       632
#define C1TSEL                        633
#define C1TSEL1                       634
#define P3TSEL                        635
#define P3TSEL0                       636
#define P3TSEL1                       637
#define SLRCONA                       638
#define SLRA0                         639
#define SLRA1                         640
#define SLRA2                         641
#define SLRA4                         642
#define SLRA5                         643
#define SLRCONC                       644
#define SLRC0                         645
#define SLRC1                         646
#define SLRC2                         647
#define SLRC3                         648
#define SLRC4                         649
#define SLRC5                         650
#define INLVLA                        651
#define INLVLA0                       652
#define INLVLA1                       653
#define INLVLA2                       654
#define INLVLA3                       655
#define INLVLA4                       656
#define INLVLA5                       657
#define INLVLC                        658
#define INLVLC0                       659
#define INLVLC1                       660
#define INLVLC2                       661
#define INLVLC3                       662
#define INLVLC4                       663
#define INLVLC5                       664
#define IOCAP                         665
#define IOCAP0                        666
#define IOCAP1                        667
#define IOCAP2                        668
#define IOCAP3                        669
#define IOCAP4                        670
#define IOCAP5                        671
#define IOCAN                         672
#define IOCAN0                        673
#define IOCAN1                        674
#define IOCAN2                        675
#define IOCAN3                        676
#define IOCAN4                        677
#define IOCAN5                        678
#define IOCAF                         679
#define IOCAF0                        680
#define IOCAF1                        681
#define IOCAF2                        682
#define IOCAF3                        683
#define IOCAF4                        684
#define IOCAF5                        685
#define IOCCP                         686
#define IOCCP0                        687
#define IOCCP1                        688
#define IOCCP2                        689
#define IOCCP3                        690
#define IOCCP4                        691
#define IOCCP5                        692
#define IOCCN                         693
#define IOCCN0                        694
#define IOCCN1                        695
#define IOCCN2                        696
#define IOCCN3                        697
#define IOCCN4                        698
#define IOCCN5                        699
#define IOCCF                         700
#define IOCCF0                        701
#define IOCCF1                        702
#define IOCCF2                        703
#define IOCCF3                        704
#define IOCCF4                        705
#define IOCCF5                        706
#define MD1CON0                       707
#define MD1BIT                        708
#define BIT                           709
#define OPOL                          710
#define MD1OPOL                       711
#define MD1CON0_OUT                   712
#define MD1OUT                        713
#define MD1CON0_EN                    714
#define MD1EN                         715
#define MD1CON1                       716
#define MD1CLSYNC                     717
#define CLSYNC                        718
#define MD1CLPOL                      719
#define CLPOL                         720
#define MD1CHSYNC                     721
#define CHSYNC                        722
#define CHPOL                         723
#define MD1CHPOL                      724
#define MD1SRC                        725
#define MD1MS0                        726
#define MS0                           727
#define MS                            728
#define MD1MS                         729
#define MD1MS1                        730
#define MS1                           731
#define MD1MS2                        732
#define MS2                           733
#define MD1MS3                        734
#define MS3                           735
#define MD1MS4                        736
#define MS4                           737
#define MD1CARL                       738
#define CL                            739
#define MD1CL                         740
#define MD1CL0                        741
#define CL0                           742
#define MD1CL1                        743
#define CL1                           744
#define MD1CL2                        745
#define CL2                           746
#define MD1CL3                        747
#define CL3                           748
#define MD1CARH                       749
#define CH                            750
#define MD1CH                         751
#define MD1CH0                        752
#define CH0                           753
#define MD1CH1                        754
#define CH1                           755
#define MD1CH2                        756
#define CH2                           757
#define MD1CH3                        758
#define CH3                           759
#define HIDRVC                        760
#define HIDC4                         761
#define HIDC5                         762
#define T4TMR                         763
#define TMR4                          764
#define T4TMR_TMR                     765
#define T4PR_PR                       766
#define T4PR                          767
#define T4CON                         768
#define T4CON_OUTPS                   769
#define T4OUTPS0                      770
#define T4OUTPS                       771
#define T4CON_OUTPS0                  772
#define T4OUTPS1                      773
#define T4CON_OUTPS1                  774
#define T4CON_OUTPS2                  775
#define T4OUTPS2                      776
#define T4OUTPS3                      777
#define T4CON_OUTPS3                  778
#define T4CKPS0                       779
#define T4CON_CKPS0                   780
#define T4CKPS                        781
#define T4CON_CKPS                    782
#define T4CKPS1                       783
#define T4CON_CKPS1                   784
#define T4CKPS2                       785
#define T4CON_CKPS2                   786
#define T4CON_ON                      787
#define T4ON                          788
#define TMR4ON                        789
#define T4HLT                         790
#define T4MODE                        791
#define T4HLT_MODE                    792
#define T4HLT_MODE0                   793
#define T4MODE0                       794
#define T4HLT_MODE1                   795
#define T4MODE1                       796
#define T4HLT_MODE2                   797
#define T4MODE2                       798
#define T4HLT_MODE3                   799
#define T4MODE3                       800
#define T4HLT_MODE4                   801
#define T4MODE4                       802
#define T4CKSYNC                      803
#define T4HLT_CKSYNC                  804
#define T4HLT_CKPOL                   805
#define T4CKPOL                       806
#define T4PSYNC                       807
#define T4HLT_PSYNC                   808
#define T4CLKCON                      809
#define T4CS                          810
#define T4CLKCON_CS                   811
#define T4CS0                         812
#define T4CLKCON_CS0                  813
#define T4CS1                         814
#define T4CLKCON_CS1                  815
#define T4CS2                         816
#define T4CLKCON_CS2                  817
#define T4CS3                         818
#define T4CLKCON_CS3                  819
#define T4RST                         820
#define T4RSEL0                       821
#define T4RSEL                        822
#define T4RST_RSEL                    823
#define T4RST_RSEL0                   824
#define T4RSEL1                       825
#define T4RST_RSEL1                   826
#define T4RSEL2                       827
#define T4RST_RSEL2                   828
#define T4RSEL3                       829
#define T4RST_RSEL3                   830
#define T6TMR                         831
#define TMR6                          832
#define T6TMR_TMR                     833
#define T6PR_PR                       834
#define T6PR                          835
#define T6CON                         836
#define T6CON_OUTPS0                  837
#define T6OUTPS                       838
#define T6CON_OUTPS                   839
#define T6OUTPS0                      840
#define T6CON_OUTPS1                  841
#define T6OUTPS1                      842
#define T6CON_OUTPS2                  843
#define T6OUTPS2                      844
#define T6CON_OUTPS3                  845
#define T6OUTPS3                      846
#define T6CON_CKPS0                   847
#define T6CKPS                        848
#define T6CKPS0                       849
#define T6CON_CKPS                    850
#define T6CON_CKPS1                   851
#define T6CKPS1                       852
#define T6CON_CKPS2                   853
#define T6CKPS2                       854
#define TMR6ON                        855
#define T6ON                          856
#define T6CON_ON                      857
#define T6HLT                         858
#define T6MODE0                       859
#define T6HLT_MODE0                   860
#define T6HLT_MODE                    861
#define T6MODE                        862
#define T6HLT_MODE1                   863
#define T6MODE1                       864
#define T6HLT_MODE2                   865
#define T6MODE2                       866
#define T6HLT_MODE3                   867
#define T6MODE3                       868
#define T6MODE4                       869
#define T6HLT_MODE4                   870
#define T6CKSYNC                      871
#define T6HLT_CKSYNC                  872
#define T6CKPOL                       873
#define T6HLT_CKPOL                   874
#define T6PSYNC                       875
#define T6HLT_PSYNC                   876
#define T6CLKCON                      877
#define T6CS                          878
#define T6CLKCON_CS                   879
#define T6CLKCON_CS0                  880
#define T6CS0                         881
#define T6CLKCON_CS1                  882
#define T6CS1                         883
#define T6CLKCON_CS2                  884
#define T6CS2                         885
#define T6CLKCON_CS3                  886
#define T6CS3                         887
#define T6RST                         888
#define T6RST_RSEL                    889
#define T6RST_RSEL0                   890
#define T6RSEL                        891
#define T6RSEL0                       892
#define T6RST_RSEL1                   893
#define T6RSEL1                       894
#define T6RSEL2                       895
#define T6RST_RSEL2                   896
#define T6RST_RSEL3                   897
#define T6RSEL3                       898
#define TMR3L                         899
#define TMR3L_TMR                     900
#define TMR3H                         901
#define TMR3H_TMR                     902
#define T3CON                         903
#define T3CON_TMRON                   904
#define TMR3ON                        905
#define T3CON_ON                      906
#define T3ON                          907
#define nT3SYNC                       908
#define T3CON_nSYNC                   909
#define T3CON_SYNC                    910
#define T3CON_CKPS0                   911
#define T3CKPS0                       912
#define T3CON_CKPS                    913
#define T3CON_CKPS1                   914
#define T3CKPS1                       915
#define TMR3CS0                       916
#define T3CON_CS0                     917
#define T3CS0                         918
#define T3CON_CS                      919
#define TMR3CS1                       920
#define T3CON_CS1                     921
#define T3CS1                         922
#define T3GCON                        923
#define T3GCON_GSS0                   924
#define T3GSS0                        925
#define T3GCON_GSS                    926
#define T3GCON_GSS1                   927
#define T3GSS1                        928
#define T3GCON_GVAL                   929
#define T3GVAL                        930
#define T3GCON_GGO_nDONE              931
#define T3GGO_nDONE                   932
#define T3GSPM                        933
#define T3GCON_GSPM                   934
#define T3GCON_GTM                    935
#define T3GTM                         936
#define T3GPOL                        937
#define T3GCON_GPOL                   938
#define TMR3GE                        939
#define T3GCON_GE                     940
#define T3GE                          941
#define TMR5L                         942
#define TMR5L_TMR                     943
#define TMR5H                         944
#define TMR5H_TMR                     945
#define T5CON                         946
#define TMR5ON                        947
#define T5CON_ON                      948
#define T5ON                          949
#define T5CON_TMRON                   950
#define T5CON_SYNC                    951
#define T5CON_nSYNC                   952
#define nT5SYNC                       953
#define T5CON_CKPS                    954
#define T5CON_CKPS0                   955
#define T5CKPS0                       956
#define T5CON_CKPS1                   957
#define T5CKPS1                       958
#define T5CON_CS                      959
#define T5CON_CS0                     960
#define T5CS0                         961
#define TMR5CS0                       962
#define T5CON_CS1                     963
#define T5CS1                         964
#define TMR5CS1                       965
#define T5GCON                        966
#define T5GSS0                        967
#define T5GCON_GSS0                   968
#define T5GCON_GSS                    969
#define T5GSS1                        970
#define T5GCON_GSS1                   971
#define T5GVAL                        972
#define T5GCON_GVAL                   973
#define T5GCON_GGO_nDONE              974
#define T5GGO_nDONE                   975
#define T5GSPM                        976
#define T5GCON_GSPM                   977
#define T5GTM                         978
#define T5GCON_GTM                    979
#define T5GPOL                        980
#define T5GCON_GPOL                   981
#define T5GE                          982
#define TMR5GE                        983
#define T5GCON_GE                     984
#define OPA1NCHS                      985
#define OPA1NCH                       986
#define OPA1NCHS_NCH                  987
#define OPA1PCHS                      988
#define OPA1PCHS_PCH                  989
#define OPA1PCH                       990
#define OPA1CON                       991
#define ORM0                          992
#define OPA1ORM0                      993
#define ORM                           994
#define OPA1ORM                       995
#define ORM1                          996
#define OPA1ORM1                      997
#define OPA1ORPOL                     998
#define ORPOL                         999
#define UG                            1000
#define OPA1UG                        1001
#define OPA1CON_EN                    1002
#define OPA1EN                        1003
#define OPA1ORS                       1004
#define ORS                           1005
#define DACLD                         1006
#define DAC1LD                        1007
#define DAC1CON0                      1008
#define DACNSS0                       1009
#define NSS0                          1010
#define DAC1CON0_DACNSS               1011
#define DAC1NSS                       1012
#define DAC1CON0_NSS                  1013
#define DAC1NSS0                      1014
#define DAC1CON0_DACPSS0              1015
#define DAC1CON0_PSS0                 1016
#define DAC1CON0_DACPSS               1017
#define DAC1CON0_PSS                  1018
#define DAC1PSS                       1019
#define DAC1PSS0                      1020
#define DAC1PSS1                      1021
#define DAC1CON0_DACPSS1              1022
#define DAC1CON0_PSS1                 1023
#define DAC1CON0_OE1                  1024
#define DAC1OE1                       1025
#define DAC1CON0_DACOE1               1026
#define DACOE                         1027
#define OE                            1028
#define FM                            1029
#define DACFM                         1030
#define DAC1FM                        1031
#define DAC1CON0_EN                   1032
#define DAC1CON0_DACEN                1033
#define DAC1EN                        1034
#define DAC1REFL                      1035
#define DAC1REF0                      1036
#define DAC1REFL_R0                   1037
#define DAC1REFL_REF0                 1038
#define DAC1R0                        1039
#define DAC1REF1                      1040
#define DAC1REFL_REF1                 1041
#define DAC1REFL_R1                   1042
#define DAC1R1                        1043
#define DAC1REF2                      1044
#define DAC1REFL_R2                   1045
#define DAC1REFL_REF2                 1046
#define DAC1R2                        1047
#define DAC1REF3                      1048
#define DAC1REFL_R3                   1049
#define DAC1REFL_REF3                 1050
#define DAC1R3                        1051
#define DAC1REF4                      1052
#define DAC1REFL_REF4                 1053
#define DAC1REFL_R4                   1054
#define DAC1R4                        1055
#define DAC1REF5                      1056
#define R5                            1057
#define DAC1REFL_REF5                 1058
#define DAC1R5                        1059
#define REF6                          1060
#define DAC1REF6                      1061
#define R6                            1062
#define DAC1R6                        1063
#define REF7                          1064
#define DAC1REF7                      1065
#define R7                            1066
#define DAC1R7                        1067
#define DAC1REFH                      1068
#define REF8                          1069
#define DAC1REF8                      1070
#define R8                            1071
#define DAC1R8                        1072
#define REF9                          1073
#define DAC1REF9                      1074
#define R9                            1075
#define DAC1R9                        1076
#define R10                           1077
#define REF10                         1078
#define DAC1R10                       1079
#define DAC1REF10                     1080
#define R11                           1081
#define REF11                         1082
#define DAC1R11                       1083
#define DAC1REF11                     1084
#define R12                           1085
#define REF12                         1086
#define DAC1REF12                     1087
#define DAC1R12                       1088
#define R13                           1089
#define REF13                         1090
