tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1765_tdd.h
#define PWM5TMRL6                     1649
#define PWM5TMRL7                     1650
#define PWM5TMRH0                     1651
#define PWM5TMRH                      1652
#define PWM5TMRH_TMR                  1653
#define PWM5TMRH1                     1654
#define PWM5TMRH2                     1655
#define PWM5TMRH3                     1656
#define PWM5TMRH4                     1657
#define PWM5TMRH5                     1658
#define PWM5TMRH6                     1659
#define PWM5TMRH7                     1660
#define PWM5CON                       1661
#define PWM5MODE0                     1662
#define PWM5CON_MODE                  1663
#define PWM5CON_MODE0                 1664
#define PWM5MODE                      1665
#define PWM5MODE1                     1666
#define PWM5CON_MODE1                 1667
#define PWM5POL                       1668
#define PWM5CON_POL                   1669
#define PWM5OUT                       1670
#define PWM5CON_OUT                   1671
#define PWM5EN                        1672
#define PWM5CON_EN                    1673
#define PWM5INTE                      1674
#define PRIE                          1675
#define PWM5PRIE                      1676
#define DCIE                          1677
#define PWM5DCIE                      1678
#define PHIE                          1679
#define PWM5PHIE                      1680
#define PWM5OFIE                      1681
#define OFIE                          1682
#define PWM5INTF                      1683
#define PRIF                          1684
#define PWM5PRIF                      1685
#define DCIF                          1686
#define PWM5DCIF                      1687
#define PHIF                          1688
#define PWM5PHIF                      1689
#define PWM5OFIF                      1690
#define OFIF                          1691
#define PWM5CLKCON                    1692
#define PWM5CS0                       1693
#define PWM5CLKCON_CS0                1694
#define PWM5CS                        1695
#define PWM5CLKCON_CS                 1696
#define PWM5CS1                       1697
#define PWM5CLKCON_CS1                1698
#define PWM5CS2                       1699
#define PWM5CLKCON_CS2                1700
#define PWM5PS                        1701
#define PWM5CLKCON_PS0                1702
#define PWM5PS0                       1703
#define PWM5CLKCON_PS                 1704
#define PWM5CLKCON_PS1                1705
#define PWM5PS1                       1706
#define PWM5CLKCON_PS2                1707
#define PWM5PS2                       1708
#define PWM5LDCON                     1709
#define LDA                           1710
#define PWM5LD                        1711
#define PWM5OFCON                     1712
#define OFO                           1713
#define PWM5OFMC                      1714
#define PPSLOCK                       1715
#define PPSLOCKED                     1716
#define INTPPS                        1717
#define T0CKIPPS                      1718
#define T1CKIPPS                      1719
#define T1GPPS                        1720
#define CCP1PPS                       1721
#define COG1INPPS                     1722
#define T2INPPS                       1723
#define T3CKIPPS                      1724
#define T3GPPS                        1725
#define T4INPPS                       1726
#define T5CKIPPS                      1727
#define T5GPPS                        1728
#define T6INPPS                       1729
#define SSPCLKPPS                     1730
#define SSPDATPPS                     1731
#define SSPSSPPS                      1732
#define RXPPS                         1733
#define CKPPS                         1734
#define CLCIN0PPS                     1735
#define CLCIN1PPS                     1736
#define CLCIN2PPS                     1737
#define CLCIN3PPS                     1738
#define PRG1RPPS                      1739
#define PRG1FPPS                      1740
#define MD1CHPPS                      1741
#define MD1CLPPS                      1742
#define MD1MODPPS                     1743
#define RA0PPS                        1744
#define RA1PPS                        1745
#define RA2PPS                        1746
#define RA4PPS                        1747
#define RA5PPS                        1748
#define RC0PPS                        1749
#define RC1PPS                        1750
#define RC2PPS                        1751
#define RC3PPS                        1752
#define RC4PPS                        1753
#define RC5PPS                        1754
#define CLCDATA                       1755
#define MCLC1OUT                      1756
#define MCLC2OUT                      1757
#define MCLC3OUT                      1758
#define CLC1CON                       1759
#define CLC1CON_MODE                  1760
#define LC1MODE0                      1761
#define LC1MODE                       1762
#define CLC1CON_MODE0                 1763
#define LC1MODE1                      1764
#define CLC1CON_MODE1                 1765
#define LC1MODE2                      1766
#define CLC1CON_MODE2                 1767
#define LC1INTN                       1768
#define CLC1CON_INTN                  1769
#define LC1INTP                       1770
#define CLC1CON_INTP                  1771
#define LC1OUT                        1772
#define CLC1CON_OUT                   1773
#define LC1EN                         1774
#define CLC1CON_EN                    1775
#define CLC1POL                       1776
#define LC1G1POL                      1777
#define CLC1POL_G1POL                 1778
#define CLC1POL_G2POL                 1779
#define LC1G2POL                      1780
#define LC1G3POL                      1781
#define CLC1POL_G3POL                 1782
#define LC1G4POL                      1783
#define CLC1POL_G4POL                 1784
#define CLC1POL_POL                   1785
#define LC1POL                        1786
#define CLC1SEL0                      1787
#define CLC1SEL0_D1S0                 1788
#define LC1D1S                        1789
#define LC1D1S0                       1790
#define CLC1SEL0_D1S                  1791
#define CLC1SEL0_D1S1                 1792
#define LC1D1S1                       1793
#define CLC1SEL0_D1S2                 1794
#define LC1D1S2                       1795
#define CLC1SEL0_D1S3                 1796
#define LC1D1S3                       1797
#define CLC1SEL0_D1S4                 1798
#define LC1D1S4                       1799
#define CLC1SEL1                      1800
#define CLC1SEL1_D2S0                 1801
#define CLC1SEL1_D2S                  1802
#define LC1D2S                        1803
#define LC1D2S0                       1804
#define CLC1SEL1_D2S1                 1805
#define LC1D2S1                       1806
#define LC1D2S2                       1807
#define CLC1SEL1_D2S2                 1808
#define LC1D2S3                       1809
#define CLC1SEL1_D2S3                 1810
#define LC1D2S4                       1811
#define CLC1SEL1_D2S4                 1812
#define CLC1SEL2                      1813
#define LC1D3S0                       1814
#define CLC1SEL2_D3S                  1815
#define LC1D3S                        1816
#define CLC1SEL2_D3S0                 1817
#define LC1D3S1                       1818
#define CLC1SEL2_D3S1                 1819
#define LC1D3S2                       1820
#define CLC1SEL2_D3S2                 1821
#define LC1D3S3                       1822
#define CLC1SEL2_D3S3                 1823
#define LC1D3S4                       1824
#define CLC1SEL2_D3S4                 1825
#define CLC1SEL3                      1826
#define CLC1SEL3_D4S                  1827
#define LC1D4S                        1828
#define LC1D4S0                       1829
#define CLC1SEL3_D4S0                 1830
#define CLC1SEL3_D4S1                 1831
#define LC1D4S1                       1832
#define LC1D4S2                       1833
#define CLC1SEL3_D4S2                 1834
#define LC1D4S3                       1835
#define CLC1SEL3_D4S3                 1836
#define LC1D4S4                       1837
#define CLC1SEL3_D4S4                 1838
#define CLC1GLS0                      1839
#define CLC1GLS0_D1N                  1840
#define LC1G1D1N                      1841
#define CLC1GLS0_D1T                  1842
#define LC1G1D1T                      1843
#define LC1G1D2N                      1844
#define CLC1GLS0_D2N                  1845
#define LC1G1D2T                      1846
#define CLC1GLS0_D2T                  1847
#define CLC1GLS0_D3N                  1848
#define LC1G1D3N                      1849
#define CLC1GLS0_D3T                  1850
#define LC1G1D3T                      1851
#define CLC1GLS0_D4N                  1852
#define LC1G1D4N                      1853
#define CLC1GLS0_D4T                  1854
#define LC1G1D4T                      1855
#define CLC1GLS1                      1856
#define CLC1GLS1_D1N                  1857
#define LC1G2D1N                      1858
#define LC1G2D1T                      1859
#define CLC1GLS1_D1T                  1860
#define CLC1GLS1_D2N                  1861
#define LC1G2D2N                      1862
#define LC1G2D2T                      1863
#define CLC1GLS1_D2T                  1864
#define CLC1GLS1_D3N                  1865
#define LC1G2D3N                      1866
#define LC1G2D3T                      1867
#define CLC1GLS1_D3T                  1868
#define CLC1GLS1_D4N                  1869
#define LC1G2D4N                      1870
#define LC1G2D4T                      1871
#define CLC1GLS1_D4T                  1872
#define CLC1GLS2                      1873
#define CLC1GLS2_D1N                  1874
#define LC1G3D1N                      1875
#define LC1G3D1T                      1876
#define CLC1GLS2_D1T                  1877
#define LC1G3D2N                      1878
#define CLC1GLS2_D2N                  1879
#define LC1G3D2T                      1880
#define CLC1GLS2_D2T                  1881
#define CLC1GLS2_D3N                  1882
#define LC1G3D3N                      1883
#define LC1G3D3T                      1884
#define CLC1GLS2_D3T                  1885
#define LC1G3D4N                      1886
#define CLC1GLS2_D4N                  1887
#define LC1G3D4T                      1888
#define CLC1GLS2_D4T                  1889
#define CLC1GLS3                      1890
#define LC1G4D1N                      1891
#define CLC1GLS3_G4D1N                1892
#define LC1G4D1T                      1893
#define CLC1GLS3_G4D1T                1894
#define CLC1GLS3_G4D2N                1895
#define LC1G4D2N                      1896
#define CLC1GLS3_G4D2T                1897
#define LC1G4D2T                      1898
#define LC1G4D3N                      1899
#define CLC1GLS3_G4D3N                1900
#define LC1G4D3T                      1901
#define CLC1GLS3_G4D3T                1902
#define CLC1GLS3_G4D4N                1903
#define LC1G4D4N                      1904
#define CLC1GLS3_G4D4T                1905
#define LC1G4D4T                      1906
#define CLC2CON                       1907
#define LC2MODE0                      1908
#define CLC2CON_MODE                  1909
#define LC2MODE                       1910
#define CLC2CON_MODE0                 1911
#define LC2MODE1                      1912
#define CLC2CON_MODE1                 1913
#define LC2MODE2                      1914
#define CLC2CON_MODE2                 1915
#define LC2INTN                       1916
#define CLC2CON_INTN                  1917
#define LC2INTP                       1918
#define CLC2CON_INTP                  1919
#define CLC2CON_OUT                   1920
#define LC2OUT                        1921
#define CLC2CON_EN                    1922
#define LC2EN                         1923
#define CLC2POL                       1924
#define LC2G1POL                      1925
#define CLC2POL_G1POL                 1926
#define LC2G2POL                      1927
#define CLC2POL_G2POL                 1928
#define LC2G3POL                      1929
#define CLC2POL_G3POL                 1930
#define LC2G4POL                      1931
#define CLC2POL_G4POL                 1932
#define CLC2POL_POL                   1933
#define LC2POL                        1934
#define CLC2SEL0                      1935
#define CLC2SEL0_D1S                  1936
#define LC2D1S0                       1937
#define CLC2SEL0_D1S0                 1938
#define LC2D1S                        1939
#define LC2D1S1                       1940
#define CLC2SEL0_D1S1                 1941
#define LC2D1S2                       1942
#define CLC2SEL0_D1S2                 1943
#define CLC2SEL0_D1S3                 1944
#define LC2D1S3                       1945
#define LC2D1S4                       1946
#define CLC2SEL0_D1S4                 1947
#define CLC2SEL1                      1948
#define LC2D2S0                       1949
#define CLC2SEL1_D2S0                 1950
#define LC2D2S                        1951
#define CLC2SEL1_D2S                  1952
#define LC2D2S1                       1953
#define CLC2SEL1_D2S1                 1954
#define LC2D2S2                       1955
#define CLC2SEL1_D2S2                 1956
#define LC2D2S3                       1957
#define CLC2SEL1_D2S3                 1958
#define LC2D2S4                       1959
#define CLC2SEL1_D2S4                 1960
#define CLC2SEL2                      1961
#define CLC2SEL2_D3S                  1962
#define LC2D3S0                       1963
#define CLC2SEL2_D3S0                 1964
#define LC2D3S                        1965
#define CLC2SEL2_D3S1                 1966
#define LC2D3S1                       1967
#define LC2D3S2                       1968
#define CLC2SEL2_D3S2                 1969
#define LC2D3S3                       1970
#define CLC2SEL2_D3S3                 1971
#define LC2D3S4                       1972
#define CLC2SEL2_D3S4                 1973
#define CLC2SEL3                      1974
#define LC2D4S                        1975
#define LC2D4S0                       1976
#define CLC2SEL3_D4S                  1977
#define CLC2SEL3_D4S0                 1978
#define LC2D4S1                       1979
#define CLC2SEL3_D4S1                 1980
#define LC2D4S2                       1981
#define CLC2SEL3_D4S2                 1982
#define CLC2SEL3_D4S3                 1983
#define LC2D4S3                       1984
#define LC2D4S4                       1985
#define CLC2SEL3_D4S4                 1986
#define CLC2GLS0                      1987
#define LC2G1D1N                      1988
#define CLC2GLS0_D1N                  1989
#define CLC2GLS0_D1T                  1990
#define LC2G1D1T                      1991
#define LC2G1D2N                      1992
#define CLC2GLS0_D2N                  1993
#define CLC2GLS0_D2T                  1994
#define LC2G1D2T                      1995
#define LC2G1D3N                      1996
#define CLC2GLS0_D3N                  1997
#define CLC2GLS0_D3T                  1998
#define LC2G1D3T                      1999
#define LC2G1D4N                      2000
#define CLC2GLS0_D4N                  2001
#define CLC2GLS0_D4T                  2002
#define LC2G1D4T                      2003
#define CLC2GLS1                      2004
#define CLC2GLS1_D1N                  2005
#define LC2G2D1N                      2006
#define CLC2GLS1_D1T                  2007
#define LC2G2D1T                      2008
#define CLC2GLS1_D2N                  2009
#define LC2G2D2N                      2010
#define CLC2GLS1_D2T                  2011
#define LC2G2D2T                      2012
#define LC2G2D3N                      2013
#define CLC2GLS1_D3N                  2014
#define LC2G2D3T                      2015
#define CLC2GLS1_D3T                  2016
#define LC2G2D4N                      2017
#define CLC2GLS1_D4N                  2018
#define LC2G2D4T                      2019
#define CLC2GLS1_D4T                  2020
#define CLC2GLS2                      2021
#define LC2G3D1N                      2022
#define CLC2GLS2_D1N                  2023
#define CLC2GLS2_D1T                  2024
#define LC2G3D1T                      2025
#define CLC2GLS2_D2N                  2026
#define LC2G3D2N                      2027
#define LC2G3D2T                      2028
#define CLC2GLS2_D2T                  2029
#define CLC2GLS2_D3N                  2030
#define LC2G3D3N                      2031
#define CLC2GLS2_D3T                  2032
#define LC2G3D3T                      2033
#define CLC2GLS2_D4N                  2034
#define LC2G3D4N                      2035
#define LC2G3D4T                      2036
#define CLC2GLS2_D4T                  2037
#define CLC2GLS3                      2038
#define LC2G4D1N                      2039
#define CLC2GLS3_G4D1N                2040
#define CLC2GLS3_G4D1T                2041
#define LC2G4D1T                      2042
#define CLC2GLS3_G4D2N                2043
#define LC2G4D2N                      2044
#define LC2G4D2T                      2045
#define CLC2GLS3_G4D2T                2046
#define CLC2GLS3_G4D3N                2047
#define LC2G4D3N                      2048
#define CLC2GLS3_G4D3T                2049
#define LC2G4D3T                      2050
#define LC2G4D4N                      2051
#define CLC2GLS3_G4D4N                2052
#define CLC2GLS3_G4D4T                2053
#define LC2G4D4T                      2054
#define CLC3CON                       2055
#define LC3MODE                       2056
#define CLC3CON_MODE0                 2057
#define LC3MODE0                      2058
#define CLC3CON_MODE                  2059
#define CLC3CON_MODE1                 2060
#define LC3MODE1                      2061
#define CLC3CON_MODE2                 2062
#define LC3MODE2                      2063
#define LC3INTN                       2064
#define CLC3CON_INTN                  2065
#define LC3INTP                       2066
#define CLC3CON_INTP                  2067
#define LC3OUT                        2068
#define CLC3CON_OUT                   2069
#define LC3EN                         2070
#define CLC3CON_EN                    2071
#define CLC3POL                       2072
#define LC3G1POL                      2073
#define CLC3POL_G1POL                 2074
#define LC3G2POL                      2075
#define CLC3POL_G2POL                 2076
#define CLC3POL_G3POL                 2077
#define LC3G3POL                      2078
#define LC3G4POL                      2079
#define CLC3POL_G4POL                 2080
#define LC3POL                        2081
#define CLC3POL_POL                   2082
#define CLC3SEL0                      2083
#define CLC3SEL0_D1S0                 2084
#define LC3D1S0                       2085
#define LC3D1S                        2086
#define CLC3SEL0_D1S                  2087
#define LC3D1S1                       2088
#define CLC3SEL0_D1S1                 2089
#define LC3D1S2                       2090
#define CLC3SEL0_D1S2                 2091
#define LC3D1S3                       2092
#define CLC3SEL0_D1S3                 2093
#define LC3D1S4                       2094
#define CLC3SEL0_D1S4                 2095
#define CLC3SEL1                      2096
#define CLC3SEL1_D2S                  2097
#define CLC3SEL1_D2S0                 2098
#define LC3D2S                        2099
#define LC3D2S0                       2100
#define CLC3SEL1_D2S1                 2101
#define LC3D2S1                       2102
#define CLC3SEL1_D2S2                 2103
#define LC3D2S2                       2104
#define CLC3SEL1_D2S3                 2105
#define LC3D2S3                       2106
#define LC3D2S4                       2107
#define CLC3SEL1_D2S4                 2108
#define CLC3SEL2                      2109
#define CLC3SEL2_D3S0                 2110
#define LC3D3S                        2111
#define CLC3SEL2_D3S                  2112
#define LC3D3S0                       2113
#define LC3D3S1                       2114
#define CLC3SEL2_D3S1                 2115
#define LC3D3S2                       2116
#define CLC3SEL2_D3S2                 2117
#define LC3D3S3                       2118
#define CLC3SEL2_D3S3                 2119
#define LC3D3S4                       2120
#define CLC3SEL2_D3S4                 2121
#define CLC3SEL3                      2122
#define CLC3SEL3_D4S0                 2123
#define LC3D4S0                       2124
#define LC3D4S                        2125
#define CLC3SEL3_D4S                  2126
#define LC3D4S1                       2127
#define CLC3SEL3_D4S1                 2128
#define LC3D4S2                       2129
#define CLC3SEL3_D4S2                 2130
#define LC3D4S3                       2131
#define CLC3SEL3_D4S3                 2132
#define LC3D4S4                       2133
#define CLC3SEL3_D4S4                 2134
#define CLC3GLS0                      2135
#define CLC3GLS0_D1N                  2136
#define LC3G1D1N                      2137
#define LC3G1D1T                      2138
#define CLC3GLS0_D1T                  2139
#define LC3G1D2N                      2140
#define CLC3GLS0_D2N                  2141
#define CLC3GLS0_D2T                  2142
#define LC3G1D2T                      2143
#define CLC3GLS0_D3N                  2144
#define LC3G1D3N                      2145
#define LC3G1D3T                      2146
#define CLC3GLS0_D3T                  2147
#define CLC3GLS0_D4N                  2148
#define LC3G1D4N                      2149
#define CLC3GLS0_D4T                  2150
#define LC3G1D4T                      2151
#define CLC3GLS1                      2152
#define LC3G2D1N                      2153
#define CLC3GLS1_D1N                  2154
#define CLC3GLS1_D1T                  2155
#define LC3G2D1T                      2156
#define LC3G2D2N                      2157
#define CLC3GLS1_D2N                  2158
#define LC3G2D2T                      2159
#define CLC3GLS1_D2T                  2160
#define LC3G2D3N                      2161
#define CLC3GLS1_D3N                  2162
#define CLC3GLS1_D3T                  2163
#define LC3G2D3T                      2164
#define LC3G2D4N                      2165
#define CLC3GLS1_D4N                  2166
#define LC3G2D4T                      2167
#define CLC3GLS1_D4T                  2168
#define CLC3GLS2                      2169
#define LC3G3D1N                      2170
#define CLC3GLS2_D1N                  2171
#define LC3G3D1T                      2172
#define CLC3GLS2_D1T                  2173
#define CLC3GLS2_D2N                  2174
#define LC3G3D2N                      2175
#define CLC3GLS2_D2T                  2176
#define LC3G3D2T                      2177
#define CLC3GLS2_D3N                  2178
#define LC3G3D3N                      2179
#define LC3G3D3T                      2180
#define CLC3GLS2_D3T                  2181
#define CLC3GLS2_D4N                  2182
#define LC3G3D4N                      2183
#define CLC3GLS2_D4T                  2184
#define LC3G3D4T                      2185
#define CLC3GLS3                      2186
#define LC3G4D1N                      2187
#define CLC3GLS3_G4D1N                2188
#define LC3G4D1T                      2189
#define CLC3GLS3_G4D1T                2190
#define LC3G4D2N                      2191
#define CLC3GLS3_G4D2N                2192
#define CLC3GLS3_G4D2T                2193
#define LC3G4D2T                      2194
#define LC3G4D3N                      2195
#define CLC3GLS3_G4D3N                2196
#define CLC3GLS3_G4D3T                2197
#define LC3G4D3T                      2198
#define LC3G4D4N                      2199
#define CLC3GLS3_G4D4N                2200
#define LC3G4D4T                      2201
#define CLC3GLS3_G4D4T                2202
#define STATUS_SHAD                   2203
#define C_SHAD                        2204
#define DC_SHAD                       2205
#define Z_SHAD                        2206
#define WREG_SHAD                     2207
#define BSR_SHAD                      2208
#define PCLATH_SHAD                   2209
#define FSR0L_SHAD                    2210
#define FSR0H_SHAD                    2211
#define FSR1L_SHAD                    2212
#define FSR1H_SHAD                    2213
#define STKPTR                        2214
#define TOSL                          2215
#define TOSH                          2216

#endif // _PIC16F1765_H_
